### PANDAS

###### pandas 기본

Series

In [1]:
import numpy as np
import pandas as pd

In [11]:
array = np.array([1, 2, 3, 4, 5], dtype='i')
series = pd.Series(array, index=['A', 'B', 'C', 'D', 'E'])
series

A    1
B    2
C    3
D    4
E    5
dtype: int32

열 지정

In [52]:
import random
list1=[[random.randint(1,100) for _ in range(5)] for __ in range(10)]
df=pd.DataFrame(list1)
df

    0   1   2   3   4
0  59  76  85  92  82
1  13  56  98  15  66
2  59  29  50  26  29
3  28  20  58   9   3
4  18  22  14  56  87
5  14  90  41  42  78
6  37  43  53  37  89
7  13  27  27  29  48
8  27   8  42  67  57
9  85   8  74  89  82

In [53]:
df[0]

0    59
1    13
2    59
3    28
4    18
5    14
6    37
7    13
8    27
9    85
Name: 0, dtype: int64

행 지정

In [54]:
df.iloc[1:3]

    0   1   2   3   4
1  13  56  98  15  66
2  59  29  50  26  29

In [67]:
df.loc[0:1]

    0   1   2   3   4
0  59  76  85  92  82
1  13  56  98  15  66

In [72]:
df.ix[1:2]

/Users/JKPark/Python/deep_python/deep_python/lib/python3.6/site-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

    0   1   2   3   4
1  13  56  98  15  66
2  59  29  50  26  29

데이터 지정

In [57]:
df

    0   1   2   3   4
0  59  76  85  92  82
1  13  56  98  15  66
2  59  29  50  26  29
3  28  20  58   9   3
4  18  22  14  56  87
5  14  90  41  42  78
6  37  43  53  37  89
7  13  27  27  29  48
8  27   8  42  67  57
9  85   8  74  89  82

In [58]:
df[0][1]

13

In [61]:
df[0].iloc[1:3]

1    13
2    59
Name: 0, dtype: int64

In [68]:
df[0].loc[1:3]

1    13
2    59
3    28
Name: 0, dtype: int64

In [70]:
df[0].ix[1:3]

/Users/JKPark/Python/deep_python/deep_python/lib/python3.6/site-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

1    13
2    59
3    28
Name: 0, dtype: int64

In [73]:
df.iloc[0, 1]

76

In [53]:
df.iloc[1, 0]

4

In [54]:
df.iloc[1][0]

4

In [6]:
arr = np.random.randint(1, 100, size=(3, 5))
arr

array([[88, 47,  2, 81, 94],
       [55, 82, 20, 80, 62],
       [63, 94,  1, 59, 37]])

In [7]:
df = pd.DataFrame(arr, columns = ['a', 'b', 'c', 'd', 'e'], index = ['id1', 'id2', 'id3'])
df

      a   b   c   d   e
id1  88  47   2  81  94
id2  55  82  20  80  62
id3  63  94   1  59  37

###### 열 순서 변경

In [78]:
df = pd.DataFrame(data=np.random.randint(1, 100, 15).reshape(3, 5), index=['a', 'b', 'c'], columns=[1, 2, 3, 4, 5])
df

    1   2   3   4   5
a  95  58  88  27  54
b  14  95   5  24  93
c  55  23  31  56  45

In [79]:
cols = list(df)
cols

[1, 2, 3, 4, 5]

In [83]:
cols.insert(0, cols.pop(cols.index(1)))

In [84]:
cols

[1, 2, 3, 4, 5]

In [85]:
df

    1   2   3   4   5
a  95  58  88  27  54
b  14  95   5  24  93
c  55  23  31  56  45

In [86]:
df = df.ix[:, cols]

/Users/JKPark/Python/deep_python/deep_python/lib/python3.6/site-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

In [89]:
df

    1   2   3   4   5
a  95  58  88  27  54
b  14  95   5  24  93
c  55  23  31  56  45

In [90]:
df1 = pd.DataFrame([[str(1), '1'],['1.1', '1,000']])
df1

     0      1
0    1      1
1  1.1  1,000

In [113]:
df1.stack()

0  0        1
   1        1
1  0      1.1
   1    1,000
dtype: object

In [112]:
df1.stack().str.replace(',','').unstack()

     0     1
0    1     1
1  1.1  1000

In [115]:
df1[0].astype(str)

0      1
1    1.1
Name: 0, dtype: object

In [117]:
df1[0].astype(float)

0    1.0
1    1.1
Name: 0, dtype: float64

In [142]:
mul_index = pd.MultiIndex.from_tuples([('category', 'cate1', '1'), ('category', 'cate1', '2'), 
                                                               ('category', 'cate2', '1'), ('category', 'cate2', '2')])
mul_col = [['plan','plan','plan','plan'],['input','input','output','output'],[1,2,1,2]]

In [143]:
df_ex = pd.DataFrame(data=np.random.randint(1, 10, 16).reshape(4,4),
                                    index=mul_index, columns=mul_col)
df_ex

                  plan
                 input    output
                     1  2      1  2
category cate1 1     2  8      1  5
               2     9  2      4  9
         cate2 1     2  2      5  2
               2     8  9      8  8